----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/yushujiang/Desktop/ECO220/Labs/Problemset5/Analysis/jiang_ps5.
> log
  log type:  text
 opened on:   5 Nov 2018, 21:43:36

. sum pdi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         pdi |        143    94.78322    15.85104         50        134

. ztest pdi=100, sd(15.85104)

One-sample z test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     pdi |     143    94.78322    1.325531    15.85104    92.18522    97.38121
------------------------------------------------------------------------------
    mean = mean(pdi)                                              z =  -3.9356
Ho: mean = 100                                   

   Ha: mean < 100               Ha: mean != 100               Ha: mean > 100
 Pr(Z < z) = 0.0000         Pr(|Z| > |z|) = 0.0001          Pr(Z > z) = 1.0000

. ztesti 143 94.78322 15.85104 100, level(99.9)

One-sample z test
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev. [99.9% Conf. Interval]
---------+--------------------------------------------------------------------
       x |     143    94.78322    1.325531    15.85104    90.42153    99.14491
------------------------------------------------------------------------------
    mean = mean(x)                                                z =  -3.9356
Ho: mean = 100                                   

   Ha: mean < 100               Ha: mean != 100               Ha: mean > 100
 Pr(Z < z) = 0.0000         Pr(|Z| > |z|) = 0.0001          Pr(Z > z) = 1.0000

. sum mdi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         mdi |        144    104.7361    15.60437         50        142

. ztest pdi==100, sd(15.60437)

One-sample z test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     pdi |     143    94.78322    1.304903    15.60437    92.22565    97.34078
------------------------------------------------------------------------------
    mean = mean(pdi)                                              z =  -3.9978
Ho: mean = 100                                   

   Ha: mean < 100               Ha: mean != 100               Ha: mean > 100
 Pr(Z < z) = 0.0000         Pr(|Z| > |z|) = 0.0001          Pr(Z > z) = 1.0000

. . ztest mdi==100, sd(15.60437)

One-sample z test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     mdi |     144    104.7361    1.300364    15.60437    102.1874    107.2848
------------------------------------------------------------------------------
    mean = mean(mdi)                                              z =   3.6421
Ho: mean = 100                                   

   Ha: mean < 100               Ha: mean != 100               Ha: mean > 100
 Pr(Z < z) = 0.9999         Pr(|Z| > |z|) = 0.0003          Pr(Z > z) = 0.0001

. ztesti 144 104.7361 15.60437 100, level(99.9)

One-sample z test
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev. [99.9% Conf. Interval]
---------+--------------------------------------------------------------------
       x |     144    104.7361    1.300364    15.60437    100.4572     109.015
------------------------------------------------------------------------------
    mean = mean(x)                                                z =   3.6421
Ho: mean = 100                                   

   Ha: mean < 100               Ha: mean != 100               Ha: mean > 100
 Pr(Z < z) = 0.9999         Pr(|Z| > |z|) = 0.0003          Pr(Z > z) = 0.0001

. mean pdi

Mean estimation                   Number of obs   =        143

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
         pdi |   94.78322   1.325531      92.16289    97.40354
--------------------------------------------------------------

. mean mdi

Mean estimation                   Number of obs   =        144

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
         mdi |   104.7361   1.300364      102.1657    107.3065
--------------------------------------------------------------

. cmd close
command cmd is unrecognized
r(199);

. cmdlog close
(cmdlog /Users/yushujiang/Desktop/ECO220/Labs/Problemset5/Analysis/jiang_ps5.do cl
> osed)

. log close
      name:  <unnamed>
       log:  /Users/yushujiang/Desktop/ECO220/Labs/Problemset5/Analysis/jiang_ps5.
> log
  log type:  text
 closed on:   5 Nov 2018, 21:47:34
----------------------------------------------------------------------------------
